<script>
//当前登录的用户的信息
const UserInfo = {
    UserName:"111",
}
const BuildingInfo={
    //标准格式A-201
    Info:[
        ['A','B','C','D','E'],
        [101,201,202,203,204,301,302,303],
        [101,102,201,202,203,204,301,302,303,401,402],
        [101,102,103],
        [101,102,201],
        [101,102],
    ],
    //从前端向后端发送Room，后端返回该Room所有被预约的时间段
    Reserve:{
        "A-101":[
            //日期
            ["2022-07-23","2022-07-20","2022-07-21"],  
            //对应预约的具体开始时间       
            ["13:00","8:00","19:30"],
            //对应预约的具体结束时间       
            ["15:00","10:00","20:30"],
            //选中时间内能否预约
            [1],

        ],
        "A-201":[
            //日期
            ["2022-07-23","2022-07-19","2022-07-21"],  
            //对应预约的具体开始时间       
            ["12:00","9:30","18:30"],
            //对应预约的具体结束时间       
            ["18:50","10:00","21:30"],
            //选中时间内能否预约
            [1],

        ],
        //如何插入预约数据
    }
}
const ChosenInfo={
    Building:"",
    Room:"",
    Union:""
}
export default({
    UserInfo,
    BuildingInfo,
    ChosenInfo
})

</script>
